app/controllers/api/server_keys_controller.rb

SELECT  "server_keys".* FROM "server_keys" WHERE "server_keys"."server_key" = $1 LIMIT $2  [["server_key", "[object Object]"], ["LIMIT", 1]]
---
  def show
    server_key = ServerKey.find_by(server_key: params[:server_key])