app/controllers/api/servers_controller.rb

  def index
    @servers = current_user.subscribed_servers.includes(:subscribed_users, :subscriptions)
    @users = Array.new
    @subscriptions = Array.new
    @servers.each do |server|
---
SELECT "servers".* FROM "servers" INNER JOIN "subscriptions" ON "servers"."id" = "subscriptions"."server_id" WHERE "subscriptions"."user_id" = $1  [["user_id", 2]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."server_id" IN ($1, $2)  [["server_id", 1], ["server_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 22], ["id", 23]]

  def create
    @server = Server.create(server_params)
    unless @server.id
      flash.now[:errors] = @server.errors.full_messages
      render partial: 'api/errors/server_errors', status: 422
    else
      @subscription = Subscription.create(user_id: current_user.id, server_id: @server.id)
---
INSERT INTO "servers" ("owner_id", "private", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["owner_id", 1], ["private", false], ["created_at", "2020-03-08 22:52:22.095107"], ["updated_at", "2020-03-08 22:52:22.095107"], ["name", "Sionar's Server"]]
INSERT INTO "subscriptions" ("user_id", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["server_id", 7], ["created_at", "2020-03-08 22:53:27.538201"], ["updated_at", "2020-03-08 22:53:27.538201"]]

  def update
    @server = Server.find_by(id: params[:id])
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]