app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)
    unless @user.save
      flash.now[:errors] = @user.errors.full_messages
      render partial: 'api/errors/session_errors', status: 422
    else
      login!(@user)
      Subscription.create({server_id: Server.first.id, user_id: @user.id})
      Subscription.create({server_id: Server.second.id, user_id: @user.id})
---
INSERT INTO "users" ("email", "username", "usertag", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "subscriptions" ("user_id", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["server_id", 1], ["created_at", "2020-03-07 23:11:23.349489"], ["updated_at", "2020-03-07 23:11:23.349489"]]
INSERT INTO "subscriptions" ("user_id", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["server_id", 2], ["created_at", "2020-03-07 23:11:23.355061"], ["updated_at", "2020-03-07 23:11:23.355061"]]