app/models/server_key.rb

SELECT  "server_keys".* FROM "server_keys" WHERE "server_keys"."server_key" = $1 LIMIT $2  [["server_key", "takzbj"], ["LIMIT", 1]]
SELECT  "server_keys".* FROM "server_keys" WHERE "server_keys"."server_key" = $1 LIMIT $2  [["server_key", "dhylqr"], ["LIMIT", 1]]
---
    def ensure_session_key
      alpha = ("a".."z").to_a
      unusedKey = false

      while (!unusedKey) do
        server_key = alpha.sample(6).join("")
        unusedKey = true if !ServerKey.find_by(server_key: server_key)