app/models/user.rb

UPDATE "users" SET "session_token" = $1, "usertag" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["session_token", "WyqM1LUCBxLpFDEFYz6UOg"], ["usertag", 1831], ["updated_at", "2020-03-06 23:31:40.295616"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 AND "users"."usertag" = $2 LIMIT $3  [["username", "Guest"], ["usertag", 1831], ["LIMIT", 1]]
---
  def ensure_usertag
    already_taken = true
    while already_taken do
      usertag = rand(1000..9999)
      already_taken = false unless User.find_by(username: self.username, usertag: usertag)